---
type: IFCRange
namespace: Autodesk.Revit.DB.IFC
version: 2024
members: 6
tags: [revit-api, class]
---

# IFCRange

`Autodesk.Revit.DB.IFC.IFCRange` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | IFCRange | — | `` |
| Constructor | IFCRange | 2013 | `public IFCRange ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | End | 2013 | `public double End { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Start | 2013 | `public double Start { get ; set ; }` |